/*
Задача 4
Написать процедуру, которая из вектора Х (k членов) строит квадратную матрицу Y по правилу:

X1^1, X2^1, …, Xk^1

X1^2, X2^2, …, Xk^2

……………………

X1^k, X2^k, …, Xk^k
Использовать процедуру для вектора T(15) и распечатать полученную матрицу в виде матрицы.
*/
#include <iostream>
using namespace std;

int main()
{
    cout << "Hello World!\n";
}